#!/usr/bin/env python 
# -*- coding: utf-8 -*-
# @Time    : 2023/6/21 11:21
# @Author  : Scott Yang
# @Site    : 
# @File    : pdf2table.py
# @Software: PyCharm
import camelot

# 读取PDF文件中的表格
tables = camelot.read_pdf('./org_table/output.pdf', pages='all', multiple_tables=True)

# 打印提取的表格
table = 0
for df in tables:
    table += 1
    data_list = list(df.df.values.tolist())
    print(f"****** {table} *******")
    for i in data_list:
        print(i)

"""
无法准确识别完整表格边界
./org_table/output.pdf
****** 1 *******
['Waist\nHip\nInseam', '22 - 23.5”\n24 - 26”\n26.5 - 28.5”\n29 - 31”\n31.5 - 33.5”\n34 - 37”\n37.5 - 41”\n31.5 - 33”\n33.5 - 35.5”\n36 - 38”\n38.5 - 40.5”\n41 - 43”\n43.5 - 46”\n46.5 - 49”\n30.5”\n31”\n31”\n31.5”\n31.5”\n31.5”\n32”', '', '', '', '', '', '']
****** 2 *******
['UK\nDE\nFR\nIT', '2XS (0-2)\nXS (4-6)\nS (8-10)\nM (12-14)\nL (16-18)\nXL (20-22)\n2XL (24-26)\n2XS (26-28)\nXS (30-32)\nS (34-36)\nM (38-40)\nL (42-44)\nXL (46-48)\n2XL (50-52)\n2XS (28-30)\nXS (32-34)\nS (36-38)\nM (40-42)\nL (44-46)\nXL (48-50)\n2XL (52-54)\n2XS (32-34)\nXS (36-38)\nS (40-42)\nM (44-46)\nL (48-50)\nXL (52-54)\n2XL (56-58)', '', '', '', '', '', '']
****** 3 *******
['Waist\nHip\nInseam', '26.5 - 28.5”\n29 - 31”\n31.5 - 33.5”\n34 - 37”\n37.5 - 41”\n36 - 38”\n38.5 - 40.5”\n41 - 43”\n43.5 - 46”\n46.5 - 49”\n33"\n33.5"\n33.5”\n33.5”\n34”', '', '', '', '']
****** 4 *******
['Waist\nHip\nInseam', '22 - 23.5”\n24 - 26”\n26.5 - 28.5”\n29 - 31”\n31.5 - 33.5”\n34 - 37”\n37.5 - 41”\n31.5 - 33”\n33.5 - 35.5”\n36 - 38”\n38.5 - 40.5”\n41 - 43”\n43.5 - 46”\n46.5 - 49”\n28.5"\n29"\n29"\n29.5"\n29.5"\n29.5"\n30"', '', '', '', '', '', '']
****** 5 *******
['Waist (Pre-\nPregnancy)\nHip\nInseam', '22 - 23.5”\n24 - 26”\n26.5 - 28.5”\n29 - 31”\n31.5 - 33.5”\n34 - 37”\n37.5 - 41”\n31.5 - 33”\n33.5 - 35.5”\n36 - 38”\n38.5 - 40.5”\n41 - 43”\n43.5 - 46”\n46.5 - 49”\n30.5”\n31”\n31”\n31.5”\n31.5”\n31.5”\n32”', '', '', '', '', '', '']
"""
